lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
holyiot_25007_nrf54l15.menu.clean_power.balanced=Balanced (Default)
holyiot_25007_nrf54l15.menu.clean_power.balanced.build.power_flags=

holyiot_25007_nrf54l15.menu.clean_power.low=Low Power (WFI Idle)
holyiot_25007_nrf54l15.menu.clean_power.low.build.power_flags=-DNRF54L15_CLEAN_POWER_LOW

holyiot_25007_nrf54l15.menu.clean_autogate.off=Disabled (Default)
holyiot_25007_nrf54l15.menu.clean_autogate.off.build.auto_gate_flags=

holyiot_25007_nrf54l15.menu.clean_autogate.balanced=Balanced (2 ms idle)
holyiot_25007_nrf54l15.menu.clean_autogate.balanced.build.auto_gate_flags=-DNRF54L15_CLEAN_AUTO_GATE=1 -DNRF54L15_CLEAN_AUTO_GATE_IDLE_US=2000

holyiot_25007_nrf54l15.menu.clean_autogate.aggressive=Aggressive (200 us idle)
holyiot_25007_nrf54l15.menu.clean_autogate.aggressive.build.auto_gate_flags=-DNRF54L15_CLEAN_AUTO_GATE=1 -DNRF54L15_CLEAN_AUTO_GATE_IDLE_US=200

holyiot_25007_nrf54l15.menu.clean_ble.on=Enabled (Default)
holyiot_25007_nrf54l15.menu.clean_ble.on.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=1

holyiot_25007_nrf54l15.menu.clean_ble.off=Disabled
holyiot_25007_nrf54l15.menu.clean_ble.off.build.ble_flags=-DNRF54L15_CLEAN_BLE_ENABLED=0 -DNRF54L15_CLEAN_BLE_DISABLED

holyiot_25007_nrf54l15.menu.clean_ble_timing.interop=Interoperability (Default)
holyiot_25007_nrf54l15.menu.clean_ble_timing.interop.build.ble_timing_flags=

holyiot_25007_nrf54l15.menu.clean_ble_timing.balanced=Balanced Low-Power
holyiot_25007_nrf54l15.menu.clean_ble_timing.balanced.build.ble_timing_flags=-DNRF54L15_CLEAN_BLE_TIMING_BALANCED=1

holyiot_25007_nrf54l15.menu.clean_ble_timing.aggressive=Aggressive Low-Power
holyiot_25007_nrf54l15.menu.clean_ble_timing.aggressive.build.ble_timing_flags=-DNRF54L15_CLEAN_BLE_TIMING_AGGRESSIVE=1

holyiot_25007_nrf54l15.menu.clean_ble_trace.off=Disabled (Default)
holyiot_25007_nrf54l15.menu.clean_ble_trace.off.build.ble_trace_flags=

holyiot_25007_nrf54l15.menu.clean_ble_trace.on=Enabled
holyiot_25007_nrf54l15.menu.clean_ble_trace.on.build.ble_trace_flags=-DNRF54L15_CLEAN_BLE_TRACE=1

holyiot_25007_nrf54l15.menu.clean_vpr.on=Enabled (Default)
holyiot_25007_nrf54l15.menu.clean_vpr.on.build.ldscript=nrf54l15_linker_script.ld
holyiot_25007_nrf54l15.menu.clean_vpr.on.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=1
holyiot_25007_nrf54l15.menu.clean_vpr.on.upload.maximum_data_size=155648

holyiot_25007_nrf54l15.menu.clean_vpr.off=Disabled (Reclaim RAM for Non-VPR Sketches)
holyiot_25007_nrf54l15.menu.clean_vpr.off.build.ldscript=nrf54l15_linker_script_no_vpr.ld
holyiot_25007_nrf54l15.menu.clean_vpr.off.build.vpr_flags=-DNRF54L15_CLEAN_VPR_ENABLED=0 -DNRF54L15_CLEAN_VPR_DISABLED
holyiot_25007_nrf54l15.menu.clean_vpr.off.upload.maximum_data_size=261632

holyiot_25007_nrf54l15.menu.clean_zigbee.on=Enabled (Default)
holyiot_25007_nrf54l15.menu.clean_zigbee.on.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=1

holyiot_25007_nrf54l15.menu.clean_zigbee.off=Disabled
holyiot_25007_nrf54l15.menu.clean_zigbee.off.build.zigbee_flags=-DNRF54L15_CLEAN_ZIGBEE_ENABLED=0 -DNRF54L15_CLEAN_ZIGBEE_DISABLED

holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch15=15 (Default)
holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch15.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=15

holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch11=11
holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch11.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=11

holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch20=20
holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch20.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=20

holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch25=25
holyiot_25007_nrf54l15.menu.clean_zigbee_channel.ch25.build.zigbee_channel_flags=-DNRF54L15_CLEAN_ZIGBEE_CHANNEL=25

holyiot_25007_nrf54l15.menu.clean_zigbee_pan.pan1234=0x1234 (Default)
holyiot_25007_nrf54l15.menu.clean_zigbee_pan.pan1234.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1234

holyiot_25007_nrf54l15.menu.clean_zigbee_pan.pan1a2b=0x1A2B
holyiot_25007_nrf54l15.menu.clean_zigbee_pan.pan1a2b.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0x1A2B

holyiot_25007_nrf54l15.menu.clean_zigbee_pan.panbeef=0xBEEF
holyiot_25007_nrf54l15.menu.clean_zigbee_pan.panbeef.build.zigbee_pan_flags=-DNRF54L15_CLEAN_ZIGBEE_PAN_ID=0xBEEF

holyiot_25007_nrf54l15.menu.clean_thread.off=Disabled (Default)
holyiot_25007_nrf54l15.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
holyiot_25007_nrf54l15.menu.clean_thread.off.build.thread_seam_flags=
holyiot_25007_nrf54l15.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

holyiot_25007_nrf54l15.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
holyiot_25007_nrf54l15.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
holyiot_25007_nrf54l15.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
holyiot_25007_nrf54l15.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

holyiot_25007_nrf54l15.menu.clean_matter.off=Disabled (Default)
holyiot_25007_nrf54l15.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
holyiot_25007_nrf54l15.menu.clean_matter.off.build.matter_seam_flags=

holyiot_25007_nrf54l15.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
holyiot_25007_nrf54l15.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
holyiot_25007_nrf54l15.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src

