lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/boards.txt
nrf54l15dk_pca10156.menu.clean_thread.off=Disabled (Default)
nrf54l15dk_pca10156.menu.clean_thread.off.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=0 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
nrf54l15dk_pca10156.menu.clean_thread.off.build.thread_seam_flags=
nrf54l15dk_pca10156.menu.clean_thread.off.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

nrf54l15dk_pca10156.menu.clean_thread.stage=Experimental Stage Core (Leader/Child/Router + UDP)
nrf54l15dk_pca10156.menu.clean_thread.stage.build.thread_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE=1 -DOPENTHREAD_FTD=1 -DOPENTHREAD_MTD=0 -DOPENTHREAD_RADIO=0
nrf54l15dk_pca10156.menu.clean_thread.stage.build.thread_seam_flags=-DOPENTHREAD_CONFIG_CORE_USER_CONFIG_HEADER_ENABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/core -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/include -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/openthread-core/src/include
nrf54l15dk_pca10156.menu.clean_thread.stage.build.thread_crypto_flags=-DNRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE=0

nrf54l15dk_pca10156.menu.clean_matter.off=Disabled (Default)
nrf54l15dk_pca10156.menu.clean_matter.off.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=0 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
nrf54l15dk_pca10156.menu.clean_matter.off.build.matter_seam_flags=

nrf54l15dk_pca10156.menu.clean_matter.stage=Experimental Compile Target (On-Network On/Off Light)
nrf54l15dk_pca10156.menu.clean_matter.stage.build.matter_flags=-DNRF54L15_CLEAN_MATTER_CORE_ENABLE=1 -DNRF54L15_CLEAN_MATTER_TRANSPORT_THREAD=1 -DNRF54L15_CLEAN_MATTER_RENDEZVOUS_ON_NETWORK_ONLY=1 -DNRF54L15_CLEAN_MATTER_BLE_RENDEZVOUS=0 -DNRF54L15_CLEAN_MATTER_FIRST_DEVICE_ONOFF_LIGHT=1
nrf54l15dk_pca10156.menu.clean_matter.stage.build.matter_seam_flags=-DNRF54L15_CLEAN_MATTER_HEADER_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_SUPPORT_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_ERROR_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_CORE_KEY_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_TIME_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_HEX_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_THREAD_DATASET_SEED_AVAILABLE=1 -DNRF54L15_CLEAN_MATTER_DATA_MODEL_SEED_AVAILABLE=1 -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/src/matter_core_stage -I{runtime.platform.path}/libraries/Nrf54L15-Clean-Implementation/third_party/connectedhomeip/src

nrf54l15dk_pca10156.menu.clean_serial.header=VCOM1 on P1.04/P1.05 (Default)
nrf54l15dk_pca10156.menu.clean_serial.header.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_ROUTE_HEADER

nrf54l15dk_pca10156.menu.clean_serial.altuart=Alternate UART on P0.00/P0.01
nrf54l15dk_pca10156.menu.clean_serial.altuart.build.serial_flags=

nrf54l15dk_pca10156.menu.clean_serial.disabled=GPIO on UART pads (Serial disabled)
nrf54l15dk_pca10156.menu.clean_serial.disabled.build.serial_flags=-DNRF54L15_CLEAN_SERIAL_DISABLED

nrf54l15dk_pca10156.menu.clean_upload.pyocd=pyOCD (CMSIS-DAP, Default)
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.pyocd.upload.use_1200bps_touch=false

nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm=pyOCD VM Safe (No Reset / VirtualBox)
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.runner=pyocd
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.pyocd_vm.upload.pyocd_safe=true

nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy=OpenOCD Direct (Experimental)
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.tool=nrf54openocd
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.tool.serial=nrf54openocd
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.runner=openocd
nrf54l15dk_pca10156.menu.clean_upload.openocd_legacy.upload.use_1200bps_touch=false

nrf54l15dk_pca10156.menu.clean_upload.uf2=UF2 Bootloader (Manual only, Optional)
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.tool=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.tool.serial=nrf54upload
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.protocol=uf2
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.runner=uf2
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.use_1200bps_touch=false
nrf54l15dk_pca10156.menu.clean_upload.uf2.upload.wait_for_upload_port=false
